In [1]:
from process.Extract import Extract
from process.Transform import Transform
from process.Load import Load
import pandas as pd

In [2]:
extract = Extract()
transform = Transform()
load = Load()

In [3]:
df_customers = extract.read_adls("datalake","landing/customers")
df_orders = extract.read_adls("datalake", "landing/orders") 
df_order_items = extract.read_adls("datalake", "landing/order_items") 
df_departments = extract.read_adls("datalake", "landing/departments") 
df_categories = extract.read_adls("datalake","landing/categories") 
df_products = extract.read_adls("datalake","landing/products")

### Transformaciones

In [6]:
df_enunciado1 = transform.enunciado1(df_customers, df_orders, df_order_items)

In [7]:
df_enunciado1.head()

,customer_id,customer_fname,customer_lname,customer_email,quantity_item_total,total
0,791,Mary,Smith,XXXXXXXXX,82,10524.17
1,8766,Mary,Duncan,XXXXXXXXX,87,9296.14
2,1657,Betty,Phillips,XXXXXXXXX,111,9223.71
3,2641,Betty,Spears,XXXXXXXXX,90,9130.92
4,1288,Evelyn,Thompson,XXXXXXXXX,89,9019.11

In [8]:
df_enunciado2 = transform.enunciado2(df_order_items, df_products,df_categories)

In [9]:
df_enunciado2.head()

         category_name  item_quantity   total
0          Accessories           5349  133671
1      As Seen on  TV!            206   20597
2  Baseball & Softball           1785   94057
3           Basketball             67   27099
4         Boxing & MMA           1265   85205

In [11]:
df_enunciado3 = transform.enunciado3(df_customers, df_orders, df_order_items, df_products, df_categories)

In [12]:
df_enunciado3.head()

  customer_city    category_name
0     Aguadilla           Cleats
1       Alameda           Cleats
2        Albany  Women's Apparel
3   Albuquerque           Cleats
4     Algonquin           Cleats

In [14]:
df_enunciado4 = transform.enunciado4(df_customers, df_orders, df_order_items, df_products, df_categories)

In [15]:
df_enunciado4.head()

,customer_city,product_name,quantity,total
0,Caguas,Perfect Fitness Perfect Rip Deck,27291,1640787.09
1,Caguas,Nike Men's Dri-FIT Victory Golf Polo,23355,1167750.00
2,Caguas,O'Brien Men's Neoprene Life Vest,21590,1079068.20
3,Caguas,Nike Men's Free 5.0+ Running Shoe,13876,1363244.70
4,Caguas,Under Armour Girls' Toddler Spine Surge Runni,12066,482732.65

### Carga a capa Gold

In [17]:
load.load_to_adls(df_enunciado1,"datalake", "gold/df_enunciado1")

In [18]:
load.load_to_adls(df_enunciado2,"datalake", "gold/df_enunciado2")

In [19]:
load.load_to_adls(df_enunciado3,"datalake", "gold/df_enunciado3")

In [20]:
load.load_to_adls(df_enunciado4,"datalake", "gold/df_enunciado4")